"""არის რიცხვი რომელის უდრის 0-ს. ფუნქციას გადაეცემა string, სვლები, რომელიც შედგება '+' და '-' ისაგნ. '+' ნიშნავს რიცხვის ერთით გაზრდას, '-' ერთით შემცირებას. დააბრუნეთ სია, სადაც გამოიტანთ ყოველი სხვლის შემდეგ რიცხვის მნიშვენობას. f("+-++-+++-----+")=[1,0,1,2,1,2,3,4,3,2,1,0,-1,0]. ახსნა: თავიდან რიცხვი უდრის 0-ს. პირველი string-ის ელემენტია '+' რაც რიცხვს ხდის 1-ს. შემდეგი ელემტია '-', რაც რიცხვს ხდის 0-ს. ასე ვაგრძელებთ სიის შევსებას."""

def myFunc(move):
    number = 0
    arr = []
    for char in move:
        if char == "+":
            number += 1
            arr.append(number)
        elif char == "-":
            number -= 1
            arr.append(number)
    return arr

print(myFunc("+-++-+++-----+"))