//(5p) ფუნქციას გადაეცემა სტრიქონი, რომელიც შედგენა პატარა ინგლისური ასოებისგან. დააბრუნეთ dictionary, სადაც იქნება რამდენჯერ მეორდება თითოეული ასო(ანბანის მიხედვით). f("hello") = {"a":0,"b":0,"c":0,"d":0,"e":1,"f":0,"g":0,"h":1,"i":0,"j":0,"k":0,"l":2,"m":0,"n":0,"o":1,"p":0,"q":0,"r":0,"s":0,"t":0,"u":0,"v":0,"w":0,"x":0,"y":0,"z":0,}

function charCount(sentence) {
    let alpha = {"a":0,"b":0,"c":0,"d":0,"e":0,"f":0,"g":0,"h":0,"i":0,"j":0,"k":0,"l":0,"m":0,"n":0,"o":0,"p":0,"q":0,"r":0,"s":0,"t":0,"u":0,"v":0,"w":0,"x":0,"y":0,"z":0,};

    for(let i = 0; i < sentence.length; i++){
        let char = sentence[i];
        alpha[char] += 1;
    }
    return alpha;
}

console.log(charCount("hello"))