//  ფუნქციას გადაეცემა სია. ყოველ სვლაზე მარცხვიდან მარჯვნივ იშლება ლუწი ინდექსები(0,2,4...). ამის შემდეგ დარჩენილი მასივიდან ისევ იშლება მარცხნიდან მარჯვნივ ლუწი ინდექსები(0,2,4...). ასე გრძელდება სანამ ყველაფერი არ წაიშლება. დააბრუნეთ სია წაშლილი რიცხვების, წაშლის თანმიმდევრობით. f([4,6,3,2,7,4,5]) = [4,3,7,5,6,4,2], ახსნა: თავდაპირველი მასივი არის: [4,6,3,2,7,4,5]. წაიშლება რიცხვები ინდექსებით 0,2,4,6(წაიშლება 4,6,3,2). მასივი წაშლის შემდეგ გახდება შემდეგნაირი: [6,2,4]. წაიშლება რიცვხები ინდექსებით 0,2(წაიშლება 6,4). მასივი გახდება: [2]. საბოლოოდ წაიშლება რიცხვი ინდექსით 0(წაიშლება 2).

function absorbArr(arr) {
    let direction = 1;
    while(arr.length != 0){
        let filteredArr = [];
        if(direction === 1){
            for(let i = 0; i < arr.length; i++){
                if(i % 2 !== 0){
                    filteredArr.push(arr[i]);
                }
            }
            direction = -1;
        }
        else {
            for(let i = arr.length; i > -1; i--){
                if(i % 2 !== 0){
                    filteredArr.push(arr[i]);
                }
            }
            direction = 1;
        }
    }
    return filteredArr;
}

console.log(absorbArr([4,6,3,2,7,4,5]))  // [4,3,7,5,6,4,2]